app/controllers/my_tasks_controller.rb

  def take
    @task = Task.find(params[:id])
    @task.assignee = session[:user]

    if @task.save then
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "updated_at" = '2010-02-13 22:42:17', "assignee_id" = 1 WHERE "id" = 9

  def drop
    @task = Task.find(params[:id])
    @task.assignee = nil

    if @task.save then
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 7)
UPDATE "tasks" SET "updated_at" = '2010-02-13 23:18:49', "assignee_id" = NULL WHERE "id" = 7

  def find_tasks_by_assignee(assignee)
    Task.find(:all, :conditions => { :assignee_id => assignee })
---
SELECT * FROM "tasks" WHERE ("tasks"."assignee_id" IS NULL)