app/controllers/tasks_controller.rb

SELECT * FROM "tasks"
---
  def index
    @tasks = Task.all

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
---
  def show
    @task = Task.find(params[:id])

SELECT * FROM "types"
SELECT * FROM "users"
---
  def new
    @task = Task.new
    @types = Type.all
    @assignees = User.all

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
SELECT * FROM "types"
SELECT * FROM "users"
---
  def edit
    @task = Task.find(params[:id])
    @types = Type.all
    @assignees = User.all

INSERT INTO "tasks" ("created_at", "assignee_id", "updated_at", "url", "type_id", "description", "audio_description", "state") VALUES('2010-02-13 09:25:21', NULL, '2010-02-13 09:25:21', 'http://blah.com', 1, 'blah', NULL, 'Open')
---
  def create
    @task = Task.new(params[:task])
    if params[:type_id] then @task[:type_id] = params[:type_id] end
    @types = Type.all
    @assignees = User.all

    respond_to do |format|
      if @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "url" = 'http://foo.com/foo', "description" = 'testing', "updated_at" = '2010-02-11 16:02:25' WHERE "id" = 1
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy